/**
 ******************************************************************************
 * @file           : math_const.h
 * @brief          : 数学常数定义
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 GMaster
 * All rights reserved.
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MATH_CONST_H
#define __MATH_CONST_H

/* Exported constants --------------------------------------------------------*/
#define MATH_PI 3.14159265358979323846f
#define MATH_E  2.71828182845904523536f

#endif /* __MATH_CONST_H */
